# GetVolume Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipingSystem..::..GetVolume Method
PipingSystem Class See Also
---
Gets the volume of this piping system.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public double GetVolume()
```

Visual Basic
---
```text
Public Function GetVolume As Double
```

Visual C++
---
```text
public:
double GetVolume()
```

# Remarks
The publicly exposed method.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The volume can not be calculated for this system. |

# See Also
PipingSystem Class
Autodesk.Revit.DB.Plumbing Namespace